Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_offences/the_law_on_fireworks.html.txt.tmx
Source language: en
Languages: ga

source: The law on fireworks
ga: An dlí maidir le tinte ealaíne

source: Up to 2006 the law on fireworks in Ireland was unclear
ga: Go dtí 2006 bhí an dlí maidir le tinte ealaíne in Éireann míshoiléir

source: While serious accidents have resulted from using fireworks, the law only covered the importation of fireworks into Ireland without a licence
ga: Cé gur tharla timpistí tromchúiseacha de bharr tinte ealaíne a úsáid, níor chlúdaigh an dlí ach allmhairiú tinte ealaíne isteach in Éirinn gan cheadúnas

source: This was more a customs and excise issue rather than a criminal issue
ga: Ba cheist don lucht custam agus mál é sin seachas ceist choiriúil

source: Part 6 of the Criminal Justice Act 2006 amended the Explosives Act 1875 to give the Gardaí the power to make arrests in relation to possession of unlicensed fireworks
ga: Rinne cuid 6 den Acht um Cheartas Coiriúil 2006 leasú ar an Acht um Pléascáin 1875 chun cumhacht a thabhairt do na Gardaí daoine a ghabháil maidir le tinte ealaíne a bheith ina seilbh acu gan cheadúnas

source: What does firework mean under the law?
ga: Céard a chiallaíonn tine ealaíne de réir an dlí?

source: The law gives a very technical definition of a firework
ga: Tugann an dlí sainmhíniú an-teicniúil ar thine ealaíne

source: A firework includes all those devices which burn and explode to give a loud noise and a visual effect – basically a typical, traditional firework
ga: Áirítear mar thine ealíne gach feiste a dhónn agus a phléascann chun fuaim ard agus éifeacht amhairc a thabhairt – tine ealaíne thipiciúil, thraidisiúnta go bunúsach

source: Bangers are now defined as fireworks
ga: Sainmhínítear tailmeálaithe mar thinte ealaíne

source: Since 4 April 2010, under European Communities (Placing on the Market of Pyrotechnic Articles) Regulations 2010 (SI 1/2010) low hazard fireworks are included as category 1 fireworks
ga: Ó 4 Aibreán 2010, faoi Rialacháin na gComhphobal Eorpach (Cur ar an Margadh Airteagail Phiriteicniúla) 2010 (IR 1/2010) tinte ealaíne guais íseal san áireamh mar chatagóir 1 tinte ealaíne

source: These low hazard fireworks are designed for indoor use and include items such as party-poppers, certain sparklers, Christmas crackers and strips of bangers or caps for toy guns
ga: Ní áirítear tinte ealaíne íseal-ghuaise. Tá na tinte ealaíne íseal-ghuaise seo deartha le n-úsáid laistigh agus áirítear iontu míreanna ar nós 'party-poppers', sparklers áirithe, pléascóga Nollag agus stiallacha tailmeálaithe nó caipíní do ghunnaí bréige

source: While categry 1 fireworks are available for sale to and use by the general public, it is an offence to sell category 1 fireworks to anyone under 16 years of age
ga: Cé go bhfuil categry 1 tinte ealaíne ar fáil le díol agus úsáid ag an bpobal i gcoitinne, is cion é chatagóir a dhíol 1 tinte ealaíne do dhuine ar bith faoi 16 bliana d'aois

source: What are the offences for having a firework?
ga: Céard iad na cionta as tine ealaíne a bheith i do sheilbh?

source: Under the amended legislation the following are offences:
ga: Faoin reachtaíocht leasaithe is cionta iad seo a leanas:

source: • If you ignite a firework or cause it to be ignited in any place, you are guilty of an offence
ga: • Má lasann tú tine ealaíne nó más tusa cúis lena lasadh in áit ar bith, tá tú ciontach i gcion

source: The offence of igniting a firework can take place anywhere and not just in a public place
ga: Féadann an cion de thine ealaíne a lasadh tarlú in áit ar bith, ní hamháin in áit phoiblí

source: It can include the garden of a private house
ga: Féadann gairdín tí príobháidigh a bheith san áireamh

source: • If you throw, direct or propel an ignited firework at or towards someone else or at property, you are guilty of an offence
ga: • Má chaitheann, má threoraíonn nó má ghluaiseann tú tine ealaíne lasta i dtreo dhuine eile nó i dtreo maoine tá tú ciontach i gcion

source: • If you have a firework with the intention of selling or supplying it to someone else (and you don't hold a licence to import it) you are guilty of an offence
ga: • Má tá tine ealíne agat agus é ar intinn agat í a dhíol nó a thabhairt do dhuine eile (agus nach bhfuil ceadúnas agat chun í a allmhairiú) tá tú ciontach i gcion

source: If you are found guilty of any of the above offences you are liable:
ga: Má fhaightear ciontach i gceann ar bith de na cionta thuas tú, beidh tú faoi dhliteanas:

source: • On summary conviction (in the District Court) to a class C fine or to imprisonment for up to 6 months or to both
ga: • Ar chiontú go hachomair (sa Chúirt Dúiche), rang C fíneáil nó phríosúnacht ar feadh suas le 6 mhí, nó an dá ceann

source: • On conviction on indictment (in the Circuit Court) to a maximum fine of €10,000 or to imprisonment for up to 5 years or to both
ga: • Ar chiontú ar dhíotáil (sa Chúirt Chuarda), fhíneáil de €10,000 ar a mhéid nó phríosúnacht ar feadh suas le 5 bliana, nó an dá ceann

source: The offences mentioned above are arrestable offences because they carry a possible 5 year jail sentence
ga: Is cionta inghabhála iad na cionta thuasluaite toisc go mbaineann an fhéidearthacht de phianbhreith príosúin 5 bliana leo

source: Therefore the Gardaí have the power to arrest you without warrant if they reasonably suspect you of having committed such an offence
ga: Mar sin tá an chumhacht ag na Gardaí tú a ghabháil gan bharántas má cheapann siad go réasúnta go ndearna tú cion dá leithéid

source: They can also detain you in a Garda station for questioning for up to 12 hours before you are charged with the offence or released
ga: Is féidir leo tú a choinneáil i stáisiún na nGardaí le haghaidh ceistiúcháin chomh maith ar feadh suas le 12 uair a chloig sula gcúiseofar tú i gcion nó sula scaoilfear tú

source: What can the Gardaí do when investigating these offences?
ga: Céard is féidir leis na Gardaí a dhéanamh agus na cionta seo á n-imscrúdú acu?

source: The Gardaí have been given wide powers in relation to the investigation of these offences
ga: Tugadh cumhachtaí leathana do na Gardaí maidir leis na cionta seo a imscrúdú

source: If the Gardaí reasonably suspect you of possessing fireworks for sale or supply without a licence they may:
ga: Tá cheapann na Gardaí go réasúnta go bhfuil tinte ealaíne i do sheilbh agat le díol nó le soláthar gan cheadúnas is féidir leo:

source: • Request your name and address
ga: • D'ainm agus do sheoladh a iarraidh

source: • Request you to go to the Garda station for the purpose of verifying your name and address (if they are not satisfied your details are correct)
ga: • Iarraidh ort dul chuig stáisiún na nGardaí chun d'ainm agus do sheoladh a fhíorú (mura bhfuil siad sásta go bhfuil na sonraí cearta tugtha agat)

source: • Search you without a warrant and detain you for such time as is necessary for the search
ga: • Tú a chuardach gan bharántas agus tú a choinneáil ar feadh an tréimhse a theastaíonn chun an cuardach a dhéanamh

source: • Enter and search any vehicle, vessel or aircraft without a warrant, if they suspect that a firework may be found there
ga: • Dul isteach i bhfeithicil, árthach nó aerárthach ar bith agus é a chuardach gan bharántas, má cheapann siad go bhfaighidís tine ealaíne ann

source: • Seize and detain anything found in the course of the search, which is connected with fireworks
ga: • Aon tine ealaíne a fhaigheann siad agus iad i mbun cuardaigh, a bhaineann le tinte ealaíne, a urghabháil agus a choimeád

source: If the Gardaí suspect that an offence of sale or supply of fireworks without a licence has been committed by you, they may arrest you without a warrant
ga: Má cheapann na Gardaí go bhfuil tú ciontach i dtinte ealaíne a dhíol nó a sholáthar gan cheadúnas, is féidir leo tú a ghabháil gan bharántas

source: The Gardaí have also been given the power to apply to the District Court for a search warrant which allows them to search a premises at any time (or times) within one week from the date of issue of the warrant
ga: Tugadh an chumhacht do na Gardaí chomh maith iarratas a chur chuig an gCúirt Dúiche chun barántas cuardaigh a fháil a thugann cead dóibh áitreabh a chuardach ag am (nó amanna) ar bith laistigh de sheachtain amháin ón dáta ar a eisítear an barántas

source: The warrant allows the Gardaí to enter a premises, by force if necessary, and it also allows them to seize anything found in the search
ga: Tugann an barántas cead do na Gardaí dul isteach in áitreabh, le fórsa más gá, agus ligeann sé dóibh aon rud a fhaightear sa chuardach a úrghabháil

source: The Gardaí are allowed to demand the name and address of anyone who is present at the premises when they are searching it
ga: Tá cead ag na Gardaí ainm agus seoladh aon duine atá i láthair ag an áitreabh agus iad á chuardach a éileamh

source: Anybody who obstructs the Gardaí during the search under the warrant may be arrested
ga: Féadfar aon duine a bhacann na Gardaí le linn an chuardaigh faoin mbarántas a ghabháil

source: If found guilty in court, you may be liable on summary conviction to a class C fine or to imprisonment for up to 6 months, or to both
ga: Má fhaightear ciontach tú sa chúirt, d'fhéadfá a bheith faoi dhliteanas rang C fíneáil nó phríosúnacht ar feadh suas le 6 mhí, nó an dá ceann

source: Can I organise a fireworks display at a special event such as a party?
ga: An féidir liom tinte ealaíne a úsáid ag ócáid speisialta mar chóisir?

source: Yes, but the fireworks must be licensed for import and only if a professional fireworks operator is used
ga: Is féidir, ach ar dtús, caithfear ceadúnas a fháil chun na tinte ealaíne a allmhairiú

source: If you want to import fireworks into Ireland you must apply for a licence or get a professional fireworks operator to apply, on your behalf, to the Department of Justice and Equality
ga: Má theastaíonn uait tinte ealaíne a allmhairiú isteach in Éirinn caithfidh tú iarratas a chur isteach ar cheadúnas chuig an Roinn Dlí agus Cirt agus Comhionannais

source: Application forms are available (Word) from the Department and can be downloaded from the Department's website
ga: Tá foirmeacha iarratais ar fáil (Word) ón Roinn agus is féidir iad a íoslódáil ó láithreán gréasáin na Roinne

source: The application must be made at least one month before the proposed event
ga: Caithfear an t-iarratas a chur isteach mí amháin ar a laghad roimh an ócáid molta

source: The licence is free
ga: Tá an ceadúnas saor in aisce

source: Details which you must provide when applying include the following:
ga: Áirítear ar na sonraí a bhfuil ort a sholáthar agus an t-iarratas á chur isteach agat:

source: • Your name and address as the applicant
ga: • D'ainm agus do sheoladh mar an iarrthóir

source: • The name and address of the organiser of the fireworks display
ga: • Ainm agus seoladh eagraí an taispeántais tinte ealaíne

source: • The name and address of the operator of the display
ga: • Ainm agus seoladh oibreoir an taispeántais

source: • The name and address of the safety officer for the display
ga: • Ainm agus seoladh an oifigigh shábháilteachta don taispeántas

source: • The date, location and reason for the display
ga: • Dáta, suíomh agus cúis an taispeántais

source: Furthermore you must confirm to the Department:
ga: Sa bhreis ar sin, caithfidh tú a dheimhniú don Roinn:

source: • That you have read and are aware of the contents of the Guidance Document on Organised Pyrotechnic Displays (pdf)
ga: • Gur léigh tú an Cháipéis Threorach ar Thaispeántais Phiriteicniúla Eagraithe (pdf) agus go bhfuil ábhair na cáipéise sin ar eolas agat

source: This document is available fromthe Department
ga: Tá an cháipéis seo le fáil ón Roinn

source: • That all operators used in the display are competent, in accordance with the guidance document
ga: • Go bhfuil na hoibreoirí go léir a úsáidtear sa taispeántas inniúil, de réir na cáipéise treoraí

source: • That adequate public liability insurance is in place
ga: • Go bhfuil árachas dliteanais phoiblí fónta acu

source: • That you have consulted the local authority Fire Officer
ga: • Gur chuaigh tú i gcomhairle le hOifigeach Dóiteáin an údaráis áitiúil

source: • That you have consulted the local Gardaí
ga: • Gur chuaigh tú i gcomhairle leis na Gardaí áitiúla

source: • That you have consulted with all other relevant interested parties, for example, your neighbours
ga: • Gur chuaigh tú i gcomhairle leis na páirtithe leasmhara ábhartha eile go léir, mar shampla, do chomharsana

source: If granted, the licence allows you to import the fireworks and operate and display them in accordance with the terms set out in the licence
ga: Mura bhfuil aon agóid ag na Gardaí cuireann siad é sin in iúl don Roinn agus ceadófar do cheadúnas

source: It is important to note that anyone who operates a fireworks display (even a small one in your own garden), without the appropriate licence is committing an offence which carries a maximum penalty of 5 years imprisonment
ga: Tá sé tábhachtach a thabhairt faoi deara go bhfuil aon duine a chuireann taispeántas tinte ealaíne ar siúl (fiú amháin ceann beag i do ghairdín féin), gan cheadúnas cuí ciontach i gcion ar a bhfuil uasphíonós de 5 bliana i bpríosún

source: In order to apply for a licence to import fireworks, you must complete an application form, or get a professional fireworks operators to complete one on your behalf, and forward this form directly to Department of Justice and Equality
ga: D'fhonn iarratas a chur isteach ar cheadúnas chun tinte ealaíne a allmhairiú, caithfidh tú foirm iarratais a chomhlánú agus a chur ar aghaidh díreach chuig an Roinn Dlí agus Cirt agus Comhionannais

source: Queries in connection with fireworks should be addressed to your local Garda station or to the Department. Where to apply
ga: Ba chóir ceisteanna maidir le tinte ealaíne a chur chuig do stáisiún Gardaí áitiúil nó chuig an Roinn
